### Yelp capstone project part 1: 
read raw file downloaded from yelp dataset challenge. Select business info of AZ restaurants. Select and join their review data in the past two years.
##### dataset is from https://www.yelp.com/dataset/challenge

#### read json file

In [1]:
import json
import pandas as pd

In [4]:
file_business, file_review = ['/Users/fanyang/Documents/yelp_project/dataset/yelp_academic_dataset_business.json',
    '/Users/fanyang/Documents/yelp_project/dataset/yelp_academic_dataset_review.json']

#### Business Data

In [5]:
with open(file_business) as f:
    df_business = pd.DataFrame(json.loads(line) for line in f)

In [6]:
df_business.head(2)

,address,attributes,business_id,categories,city,hours,is_open,latitude,longitude,name,neighborhood,postal_code,review_count,stars,state
0,1314 44 Avenue NE,"{'BikeParking': 'False', 'BusinessAcceptsCredi...",Apn5Q_b6Nz61Tq4XzPdf9A,"Tours, Breweries, Pizza, Restaurants, Food, Ho...",Calgary,"{'Monday': '8:30-17:0', 'Tuesday': '11:0-21:0'...",1,51.091813,-114.031675,Minhas Micro Brewery,,T2E 6L6,24,4.0,AB
1,,"{'Alcohol': 'none', 'BikeParking': 'False', 'B...",AjEbIBw6ZFfln7ePHha9PA,"Chicken Wings, Burgers, Caterers, Street Vendo...",Henderson,"{'Friday': '17:0-23:0', 'Saturday': '17:0-23:0...",0,35.960734,-114.939821,CK'S BBQ & Catering,,89002,3,4.5,NV

In [7]:
df_business.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 188593 entries, 0 to 188592
Data columns (total 15 columns):
address         188593 non-null object
attributes      162807 non-null object
business_id     188593 non-null object
categories      188052 non-null object
city            188593 non-null object
hours           143791 non-null object
is_open         188593 non-null int64
latitude        188587 non-null float64
longitude       188587 non-null float64
name            188593 non-null object
neighborhood    188593 non-null object
postal_code     188593 non-null object
review_count    188593 non-null int64
stars           188593 non-null float64
state           188593 non-null object
dtypes: float64(3), int64(2), object(10)
memory usage: 21.6+ MB

In [8]:
df_business.shape

(188593, 15)

#### Review Data

In [9]:
with open(file_review) as f:
    df_review = pd.DataFrame(json.loads(line) for line in f)
df_review.head(2)

,business_id,cool,date,funny,review_id,stars,text,useful,user_id
0,iCQpiavjjPzJ5_3gPD5Ebg,0,2011-02-25,0,x7mDIiDB3jEiPGPHOmDzyw,2,The pizza was okay. Not the best I've had. I p...,0,msQe1u7Z_XuqjGoqhB0J5g
1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g

In [10]:
df_review.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5996996 entries, 0 to 5996995
Data columns (total 9 columns):
business_id    object
cool           int64
date           object
funny          int64
review_id      object
stars          int64
text           object
useful         int64
user_id        object
dtypes: int64(4), object(5)
memory usage: 411.8+ MB

#### select business data about restaurants in AZ

In [11]:
df_business['state'].value_counts().head()

AZ    56495
NV    35688
ON    32393
NC    14359
OH    13664
Name: state, dtype: int64

In [14]:
# select business data about AZ restaurants 

cond_state = df_business['state'] == 'AZ'

cond_category_not_null = -df_business['categories'].isnull()

cond_category_restaurant = df_business["categories"].apply(str).str.contains("Restaurants")


df_selected_business_AZ = df_business[cond_state & cond_category_not_null & cond_category_restaurant]

In [15]:
df_selected_business_AZ.shape

(11072, 15)

In [16]:
df_selected_business_AZ.head(3)

,address,attributes,business_id,categories,city,hours,is_open,latitude,longitude,name,neighborhood,postal_code,review_count,stars,state
8,1440 N. Dysart Ave,"{'Alcohol': 'none', 'Ambience': '{'romantic': ...",8-NRKkPY1UiFXW20WXKiXg,"Mexican, Restaurants",Avondale,"{'Monday': '0:0-0:0', 'Tuesday': '0:0-0:0', 'W...",1,33.448106,-112.341302,Filiberto's Mexican Food,,85323,40,2.5,AZ
12,2801 N 15th Ave,"{'Alcohol': 'full_bar', 'Ambience': '{'romanti...",_c3ixq9jYKxhLUB0czi0ug,"Bars, Sports Bars, Dive Bars, Burgers, Nightli...",Phoenix,"{'Monday': '11:0-22:0', 'Tuesday': '11:0-22:0'...",1,33.479807,-112.091188,Original Hamburger Works,,85007,277,4.0,AZ
22,4131 N 83rd Ave,"{'Ambience': '{'romantic': False, 'intimate': ...",3ByGQOVgds2YEu6kzl-XEQ,"Nightlife, Bars, American (Traditional), Sport...",Phoenix,None,1,33.495298,-112.236076,Rib Shop,,85033,3,2.5,AZ

In [18]:
# save busines info about AZ restaurant

df_selected_business_AZ.to_csv('/Users/fanyang/Documents/yelp_project/12_24/selected_business_AZrestaurant.csv')

In [23]:
df = pd.read_csv('/Users/fanyang/Documents/yelp_project/12_24/selected_business_AZrestaurant.csv',
           encoding="utf-8")

In [27]:
df.head(3)

,Unnamed: 0,address,attributes,business_id,categories,city,hours,is_open,latitude,longitude,name,neighborhood,postal_code,review_count,avg_stars,state
0,8,1440 N. Dysart Ave,"{'Alcohol': 'none', 'Ambience': ""{'romantic': ...",8-NRKkPY1UiFXW20WXKiXg,"Mexican, Restaurants",Avondale,"{'Monday': '0:0-0:0', 'Tuesday': '0:0-0:0', 'W...",1,33.448106,-112.341302,Filiberto's Mexican Food,NaN,85323.0,40,2.5,AZ
1,12,2801 N 15th Ave,"{'Alcohol': 'full_bar', 'Ambience': ""{'romanti...",_c3ixq9jYKxhLUB0czi0ug,"Bars, Sports Bars, Dive Bars, Burgers, Nightli...",Phoenix,"{'Monday': '11:0-22:0', 'Tuesday': '11:0-22:0'...",1,33.479807,-112.091188,Original Hamburger Works,NaN,85007.0,277,4.0,AZ
2,22,4131 N 83rd Ave,"{'Ambience': ""{'romantic': False, 'intimate': ...",3ByGQOVgds2YEu6kzl-XEQ,"Nightlife, Bars, American (Traditional), Sport...",Phoenix,NaN,1,33.495298,-112.236076,Rib Shop,NaN,85033.0,3,2.5,AZ

In [35]:
df.rename(columns={'avg_stars':'stars'}, inplace=True)

In [36]:
selected_features = [u'business_id', u'name', u'categories', u'stars']

In [37]:
# select subset of dataframe info

df_selected_business = df[selected_features]

In [38]:
df_selected_business.shape

(11072, 4)

In [39]:
df_selected_business.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11072 entries, 0 to 11071
Data columns (total 4 columns):
business_id    11072 non-null object
name           11072 non-null object
categories     11072 non-null object
stars          11072 non-null float64
dtypes: float64(1), object(3)
memory usage: 346.1+ KB

In [49]:
df_selected_business.head(3)

,business_id,name,categories,stars
0,8-NRKkPY1UiFXW20WXKiXg,Filiberto's Mexican Food,"Mexican, Restaurants",2.5
1,_c3ixq9jYKxhLUB0czi0ug,Original Hamburger Works,"Bars, Sports Bars, Dive Bars, Burgers, Nightli...",4.0
2,3ByGQOVgds2YEu6kzl-XEQ,Rib Shop,"Nightlife, Bars, American (Traditional), Sport...",2.5

In [50]:
df_selected_business.to_csv('/Users/fanyang/Documents/yelp_project/12_24/selected_business_feat.csv')

In [51]:
df = pd.read_csv('/Users/fanyang/Documents/yelp_project/12_24/selected_business_feat.csv',
           encoding="utf-8")

#### prepare review data for join

In [41]:
df_review.head(2)

,business_id,cool,date,funny,review_id,stars,text,useful,user_id
0,iCQpiavjjPzJ5_3gPD5Ebg,0,2011-02-25,0,x7mDIiDB3jEiPGPHOmDzyw,2,The pizza was okay. Not the best I've had. I p...,0,msQe1u7Z_XuqjGoqhB0J5g
1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g

#### join review and business data on business_id

In [42]:
# Prepare the review dataframe and set index to column "business_id", and name it as df_right

df_right = df_review.set_index('business_id')

In [56]:
df_right.head(3)

,cool,date,funny,review_id,stars,text,useful,user_id
business_id,,,,,,,,
iCQpiavjjPzJ5_3gPD5Ebg,0,2011-02-25,0,x7mDIiDB3jEiPGPHOmDzyw,2,The pizza was okay. Not the best I've had. I p...,0,msQe1u7Z_XuqjGoqhB0J5g
pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g
jtQARsP6P-LbkyjbO1qNGg,1,2014-10-23,1,LZp4UX5zK3e-c5ZGSeo3kA,1,Terrible. Dry corn bread. Rib tips were all fa...,3,msQe1u7Z_XuqjGoqhB0J5g

In [52]:
df_left = df.set_index('business_id')

In [53]:
df_left.head(3)

,Unnamed: 0,name,categories,stars
business_id,,,,
8-NRKkPY1UiFXW20WXKiXg,0,Filiberto's Mexican Food,"Mexican, Restaurants",2.5
_c3ixq9jYKxhLUB0czi0ug,1,Original Hamburger Works,"Bars, Sports Bars, Dive Bars, Burgers, Nightli...",4.0
3ByGQOVgds2YEu6kzl-XEQ,2,Rib Shop,"Nightlife, Bars, American (Traditional), Sport...",2.5

In [57]:
df_left.rename(columns={"stars": "starts_business"}, inplace=True)

In [58]:
df_right.shape, df_left.shape

((5996996, 8), (11072, 4))

In [59]:
# Join df_left and df_right. What type of join?

df_joined = df_left.join(df_right, how = 'inner')

In [60]:
df_joined.shape

(1048582, 12)

In [61]:
df_joined.reset_index(inplace = True)

In [62]:
df_joined.head(3)

,business_id,Unnamed: 0,name,categories,starts_business,cool,date,funny,review_id,stars,text,useful,user_id
0,--g-a85VwrdZJNf0R95GcQ,1945,Kabab House,"Lebanese, Restaurants, Greek, Juice Bars & Smo...",4.5,1,2013-11-14,0,EQF-SyHb_Yg0HC9E9BppOg,5,super fresh food..great prices. ala carte and ...,3,SvsoiaCf0WG7UIDJOxJ7Yg
1,--g-a85VwrdZJNf0R95GcQ,1945,Kabab House,"Lebanese, Restaurants, Greek, Juice Bars & Smo...",4.5,0,2014-09-13,0,GwymU3qC1Ppatuwm6TE23w,4,This probably one of the better Middle Eastern...,0,1YRDt0Bqmxsp6DHIm0SuwQ
2,--g-a85VwrdZJNf0R95GcQ,1945,Kabab House,"Lebanese, Restaurants, Greek, Juice Bars & Smo...",4.5,0,2014-05-31,0,YZNj0R3_BrwRwhYECtwx_Q,5,"My Daughter, grandsons and I were looking for ...",0,etKVjwicBlzBLydl9t-cew

In [64]:
# find out the last date of review
df_joined['date'].value_counts().head()

2018-03-11    1034
2018-03-25     996
2018-03-04     965
2018-02-18     963
2018-02-25     956
Name: date, dtype: int64

#### select reviews from the past two years

In [66]:
con_last_2years = df_joined['date'] > u'2016-03-11'

In [67]:
df_final = df_joined[con_last_2years]

In [68]:
df_final.shape

(462965, 13)

In [69]:
# save to csv, this file contains reviews of AZ restaurant between 2016-03-11 and 2018-03-11

df_final.to_csv('/Users/fanyang/Documents/yelp_project/12_24/last_2_years_restaurant_reviews_AZ.csv', 
                index=False,
                encoding='utf-8')